{
  "events":
  [
      {
          "name": "2016 Australian Federal Election",
          "date": "2016-07-04",
          "description": "The 2016 Australian federal election was a double dissolution election held on Saturday 2 July to elect all 226 members of the 45th Parliament of Australia, after an extended eight-week official campaign period. It was the first double dissolution election since the 1987 election and the first under a new voting system for the Senate that replaced group voting tickets with optional preferential voting. The final outcome in the 76-seat Senate took over four weeks to complete despite significant voting changes. Announced on 4 August, it revealed a reduced plurality of 30 seats for the Coalition, 26 for Labor, and a record 20 for crossbenchers including 9 Greens, 4 from One Nation and 3 from the Xenophon Team. "
      },
      {
          "name": "China-Australia Free Trade Agreement",
          "date": "2015-12-20",
          "description": "The China–Australia Free Trade Agreement (ChAFTA) entered into force on 20 December 2015. ChAFTA is an historic agreement that is delivering enormous benefits to Australia, enhancing our competitive position in the Chinese market, boosting economic growth and creating jobs."
      },
      {
          "name": "Carbon price is dropped",
          "date": "2014-07-14",
          "description": "Australia no longer has a carbon tax, after the Government finally secured enough Senate support to kill it off, fulfilling a key election promise for Prime Minister Tony Abbott. The final vote to scrap the carbon tax was won by the Coalition 39 to 32, with the micro-party senators, including those from the Palmer United Party, voting with the Government."
      },
      {
          "name": "2013 Australian Federal Election",
          "date": "2013-09-09",
          "description": "A federal election to determine the members of the 44th Parliament of Australia took place on 7 September 2013. The centre-right Liberal/National Coalition opposition led by then-Opposition leader Tony Abbott of the Liberal Party of Australia and Coalition partner the National Party of Australia, led by Warren Truss, defeated the incumbent centre-left Labor Party government of Prime Minister Kevin Rudd by a 17-seat 3.6 percentage point two-party swing. Labor had been in government since the 2007 election. Abbott was sworn in by the Governor-General, Quentin Bryce as Australia's 28th Prime Minister on 18 September 2013 along with the Abbott Ministry and the members of the House of Representatives. "
      },
      {
          "name": "Clean Energy Bill is introduced",
          "date": "2011-02-24",
          "description": "The Clean Energy Act 2011 was an Act of the Australian Parliament, the main Act in a package of legislation that established an Australian emissions trading scheme (ETS), to be preceded by a three-year period of fixed carbon pricing in Australia designed to reduce carbon dioxide emissions[1] as part of efforts to combat global warming. The package was introduced by the Gillard Labor Government in February 2011 and was repealed by the Abbott Government on 17 July 2014, backdated to 1 July 2014"
      }
  ]
}